[Killed] ConditionalExpression
src/components/QrCodeDisplay.tsx:22:9
   const [showPlaceholder, setShowPlaceholder] = useState(false);
 
   useEffect(() => {
-    if (!text.trim()) {
+    if (true) {
       const timeoutId = setTimeout(() => {
         setShowPlaceholder(true);
killedBy: QrCodeDisplay Component should verify else branch execution by checking placeholder state transition
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p
  class="text-gray-500 text-center px-4"
>
  Enter content to generate QR code
</p> instead
