[NoCoverage] BlockStatement
src/App.tsx:25:57
     canvasRef,
   } = useQRCodeGenerator();
 
-  const handlePresetColor = (fg: string, bg: string) => {
-    setForegroundColor(fg);
-    setBackgroundColor(bg);
-  };
+  const handlePresetColor = (fg: string, bg: string) => {};
 
   return (
