[Survived] StringLiteral
src/hooks/useQRCodeGenerator.ts:18:36
 };
 
 export const useQRCodeGenerator = (): UseQRCodeGeneratorResult => {
-  const [text, setText] = useState('https://example.com');
+  const [text, setText] = useState("");
   const [qrDataUrl, setQrDataUrl] = useState('');
   const [foregroundColor, setForegroundColor] = useState('#000000');

[Survived] BooleanLiteral
src/hooks/useQRCodeGenerator.ts:22:52
   const [qrDataUrl, setQrDataUrl] = useState('');
   const [foregroundColor, setForegroundColor] = useState('#000000');
   const [backgroundColor, setBackgroundColor] = useState('#ffffff');
-  const [isGenerating, setIsGenerating] = useState(false);
+  const [isGenerating, setIsGenerating] = useState(true);
   const canvasRef = useRef<HTMLCanvasElement>(null);
 

[Killed] ConditionalExpression
src/hooks/useQRCodeGenerator.ts:26:9
   const canvasRef = useRef<HTMLCanvasElement>(null);
 
   const generateQR = useCallback(async (inputText: string) => {
-    if (!inputText.trim()) {
+    if (true) {
       setQrDataUrl('');
       return;
killedBy: useQRCodeGenerator Hook should use correct color configuration
statusReason: expected "bound renderCanvas" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BooleanLiteral
src/hooks/useQRCodeGenerator.ts:26:9
   const canvasRef = useRef<HTMLCanvasElement>(null);
 
   const generateQR = useCallback(async (inputText: string) => {
-    if (!inputText.trim()) {
+    if (inputText.trim()) {
       setQrDataUrl('');
       return;
killedBy: useQRCodeGenerator Hook should use correct color configuration
statusReason: expected "bound renderCanvas" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[NoCoverage] StringLiteral
src/hooks/useQRCodeGenerator.ts:27:20
 
   const generateQR = useCallback(async (inputText: string) => {
     if (!inputText.trim()) {
-      setQrDataUrl('');
+      setQrDataUrl("Stryker was here!");
       return;
     }

[Survived] BooleanLiteral
src/hooks/useQRCodeGenerator.ts:31:21
       return;
     }
 
-    setIsGenerating(true);
+    setIsGenerating(false);
     try {
       const canvas = canvasRef.current;

[Killed] BlockStatement
src/hooks/useQRCodeGenerator.ts:32:9
     }
 
     setIsGenerating(true);
-    try {
-      const canvas = canvasRef.current;
-      if (canvas) {
-        await QRCode.toCanvas(canvas, inputText, {
-          version: undefined,
-          width: 300,
-          margin: 2,
-          color: {
-            dark: foregroundColor,
-            light: backgroundColor,
-          },
-          errorCorrectionLevel: 'M',
-        });
-        const dataUrl = canvas.toDataURL('image/png');
-        setQrDataUrl(dataUrl);
-      }
-    } catch (error) {
+    try {} catch (error) {
       console.error('Error generating QR code:', error);
       setQrDataUrl('');
killedBy: useQRCodeGenerator Hook should use correct color configuration
statusReason: expected "bound renderCanvas" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
src/hooks/useQRCodeGenerator.ts:34:19
     setIsGenerating(true);
     try {
       const canvas = canvasRef.current;
-      if (canvas) {
-        await QRCode.toCanvas(canvas, inputText, {
-          version: undefined,
-          width: 300,
-          margin: 2,
-          color: {
-            dark: foregroundColor,
-            light: backgroundColor,
-          },
-          errorCorrectionLevel: 'M',
-        });
-        const dataUrl = canvas.toDataURL('image/png');
-        setQrDataUrl(dataUrl);
-      }
+      if (canvas) {}
     } catch (error) {
       console.error('Error generating QR code:', error);
killedBy: useQRCodeGenerator Hook should use correct color configuration
statusReason: expected "bound renderCanvas" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
src/hooks/useQRCodeGenerator.ts:34:11
     setIsGenerating(true);
     try {
       const canvas = canvasRef.current;
-      if (canvas) {
+      if (false) {
         await QRCode.toCanvas(canvas, inputText, {
           version: undefined,
killedBy: useQRCodeGenerator Hook should use correct color configuration
statusReason: expected "bound renderCanvas" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ObjectLiteral
src/hooks/useQRCodeGenerator.ts:35:50
     try {
       const canvas = canvasRef.current;
       if (canvas) {
-        await QRCode.toCanvas(canvas, inputText, {
-          version: undefined,
-          width: 300,
-          margin: 2,
-          color: {
-            dark: foregroundColor,
-            light: backgroundColor,
-          },
-          errorCorrectionLevel: 'M',
-        });
+        await QRCode.toCanvas(canvas, inputText, {});
         const dataUrl = canvas.toDataURL('image/png');
         setQrDataUrl(dataUrl);
killedBy: useQRCodeGenerator Hook should use correct color configuration
statusReason: expected "bound renderCanvas" to be called with arguments: [ <canvas></canvas>, …(2) ]

Received: 

  1st bound renderCanvas call:

  [
    <canvas />,

[Killed] ObjectLiteral
src/hooks/useQRCodeGenerator.ts:39:18
           version: undefined,
           width: 300,
           margin: 2,
-          color: {
-            dark: foregroundColor,
-            light: backgroundColor,
-          },
+          color: {},
           errorCorrectionLevel: 'M',
         });
killedBy: useQRCodeGenerator Hook should use correct color configuration
statusReason: expected "bound renderCanvas" to be called with arguments: [ <canvas></canvas>, …(2) ]

Received: 

  1st bound renderCanvas call:

@@ -1,13 +1,10 @@
  [

[Killed] StringLiteral
src/hooks/useQRCodeGenerator.ts:43:33
             dark: foregroundColor,
             light: backgroundColor,
           },
-          errorCorrectionLevel: 'M',
+          errorCorrectionLevel: "",
         });
         const dataUrl = canvas.toDataURL('image/png');
killedBy: useQRCodeGenerator Hook should use correct color configuration
statusReason: expected "bound renderCanvas" to be called with arguments: [ <canvas></canvas>, …(2) ]

Received: 

  1st bound renderCanvas call:

@@ -4,11 +4,11 @@
    {

[Survived] StringLiteral
src/hooks/useQRCodeGenerator.ts:45:42
           },
           errorCorrectionLevel: 'M',
         });
-        const dataUrl = canvas.toDataURL('image/png');
+        const dataUrl = canvas.toDataURL("");
         setQrDataUrl(dataUrl);
       }

[NoCoverage] BlockStatement
src/hooks/useQRCodeGenerator.ts:48:21
         const dataUrl = canvas.toDataURL('image/png');
         setQrDataUrl(dataUrl);
       }
-    } catch (error) {
-      console.error('Error generating QR code:', error);
-      setQrDataUrl('');
-    } finally {
+    } catch (error) {} finally {
       setIsGenerating(false);
     }

[Survived] BlockStatement
src/hooks/useQRCodeGenerator.ts:51:15
     } catch (error) {
       console.error('Error generating QR code:', error);
       setQrDataUrl('');
-    } finally {
-      setIsGenerating(false);
-    }
+    } finally {}
   }, [foregroundColor, backgroundColor]);
 

[Survived] BooleanLiteral
src/hooks/useQRCodeGenerator.ts:52:23
       console.error('Error generating QR code:', error);
       setQrDataUrl('');
     } finally {
-      setIsGenerating(false);
+      setIsGenerating(true);
     }
   }, [foregroundColor, backgroundColor]);

[Killed] BlockStatement
src/hooks/useQRCodeGenerator.ts:56:19
     }
   }, [foregroundColor, backgroundColor]);
 
-  useEffect(() => {
-    const timeoutId = setTimeout(() => {
-      generateQR(text);
-    }, 300);
-
-    return () => clearTimeout(timeoutId);
-  }, [text, foregroundColor, backgroundColor, generateQR]);
+  useEffect(() => {}, [text, foregroundColor, backgroundColor, generateQR]);
 
   const downloadQR = useCallback(() => {
killedBy: useQRCodeGenerator Hook should use correct color configuration
statusReason: expected "bound renderCanvas" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
src/hooks/useQRCodeGenerator.ts:57:40
   }, [foregroundColor, backgroundColor]);
 
   useEffect(() => {
-    const timeoutId = setTimeout(() => {
-      generateQR(text);
-    }, 300);
+    const timeoutId = setTimeout(() => {}, 300);
 
     return () => clearTimeout(timeoutId);
killedBy: useQRCodeGenerator Hook should use correct color configuration
statusReason: expected "bound renderCanvas" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[NoCoverage] BlockStatement
src/hooks/useQRCodeGenerator.ts:64:40
     return () => clearTimeout(timeoutId);
   }, [text, foregroundColor, backgroundColor, generateQR]);
 
-  const downloadQR = useCallback(() => {
-    if (qrDataUrl) {
-      const link = document.createElement('a');
-      link.download = `qr-code-${Date.now()}.png`;
-      link.href = qrDataUrl;
-      document.body.appendChild(link);
-      link.click();
-      document.body.removeChild(link);
-    }
-  }, [qrDataUrl]);
+  const downloadQR = useCallback(() => {}, [qrDataUrl]);
 
   return {

[NoCoverage] ConditionalExpression
src/hooks/useQRCodeGenerator.ts:65:9
   }, [text, foregroundColor, backgroundColor, generateQR]);
 
   const downloadQR = useCallback(() => {
-    if (qrDataUrl) {
+    if (false) {
       const link = document.createElement('a');
       link.download = `qr-code-${Date.now()}.png`;

[NoCoverage] ConditionalExpression
src/hooks/useQRCodeGenerator.ts:65:9
   }, [text, foregroundColor, backgroundColor, generateQR]);
 
   const downloadQR = useCallback(() => {
-    if (qrDataUrl) {
+    if (true) {
       const link = document.createElement('a');
       link.download = `qr-code-${Date.now()}.png`;

[Survived] ArrayDeclaration
src/hooks/useQRCodeGenerator.ts:73:6
       link.click();
       document.body.removeChild(link);
     }
-  }, [qrDataUrl]);
+  }, []);
 
   return {

[Killed] ObjectLiteral
src/hooks/useQRCodeGenerator.ts:75:10
     }
   }, [qrDataUrl]);
 
-  return {
-    text,
-    qrDataUrl,
-    foregroundColor,
-    backgroundColor,
-    isGenerating,
-    setText,
-    setForegroundColor,
-    setBackgroundColor,
-    downloadQR,
-    canvasRef,
-  };
+  return {};
 };
killedBy: useQRCodeGenerator Hook should use correct color configuration
statusReason: Cannot read properties of undefined (reading 'current')
