[Killed] ArrayDeclaration
src/components/ColorPresets.tsx:8:24
 };
 
 const ColorPresets: React.FC<ColorPresetsProps> = ({ onPresetSelect }) => {
-  const presetColors = [
-    { name: 'Classic', fg: '#000000', bg: '#ffffff' },
-    { name: 'Ocean', fg: '#1e3a8a', bg: '#dbeafe' },
-    { name: 'Forest', fg: '#166534', bg: '#dcfce7' },
-    { name: 'Sunset', fg: '#dc2626', bg: '#fef2f2' },
-    { name: 'Purple', fg: '#7c3aed', bg: '#f3e8ff' },
-    { name: 'Amber', fg: '#d97706', bg: '#fef3c7' },
-  ];
+  const presetColors = [];
 
   return (
killedBy: ColorPresets Component should render all 6 preset buttons
statusReason: Unable to find an element with the text: Classic. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <label
        class="text-sm font-medium text-gray-700 mb-3 block text-center"

[Killed] StringLiteral
src/components/ColorPresets.tsx:9:28
 
 const ColorPresets: React.FC<ColorPresetsProps> = ({ onPresetSelect }) => {
   const presetColors = [
-    { name: 'Classic', fg: '#000000', bg: '#ffffff' },
+    { name: 'Classic', fg: "", bg: '#ffffff' },
     { name: 'Ocean', fg: '#1e3a8a', bg: '#dbeafe' },
     { name: 'Forest', fg: '#166534', bg: '#dcfce7' },
killedBy: ColorPresets Component should call onPresetSelect with correct colors when Classic preset is clicked
statusReason: expected "spy" to be called with arguments: [ '#000000', '#ffffff' ]

Received: 

  1st spy call:

  [
-   "#000000",

[Killed] ObjectLiteral
src/components/ColorPresets.tsx:11:5
   const presetColors = [
     { name: 'Classic', fg: '#000000', bg: '#ffffff' },
     { name: 'Ocean', fg: '#1e3a8a', bg: '#dbeafe' },
-    { name: 'Forest', fg: '#166534', bg: '#dcfce7' },
+    {},
     { name: 'Sunset', fg: '#dc2626', bg: '#fef2f2' },
     { name: 'Purple', fg: '#7c3aed', bg: '#f3e8ff' },
killedBy: ColorPresets Component should render all 6 preset buttons
statusReason: Unable to find an element with the text: Forest. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <label
        class="text-sm font-medium text-gray-700 mb-3 block text-center"

[Killed] StringLiteral
src/components/ColorPresets.tsx:11:27
   const presetColors = [
     { name: 'Classic', fg: '#000000', bg: '#ffffff' },
     { name: 'Ocean', fg: '#1e3a8a', bg: '#dbeafe' },
-    { name: 'Forest', fg: '#166534', bg: '#dcfce7' },
+    { name: 'Forest', fg: "", bg: '#dcfce7' },
     { name: 'Sunset', fg: '#dc2626', bg: '#fef2f2' },
     { name: 'Purple', fg: '#7c3aed', bg: '#f3e8ff' },
killedBy: ColorPresets Component should call onPresetSelect with correct colors when Forest preset is clicked
statusReason: expected "spy" to be called with arguments: [ '#166534', '#dcfce7' ]

Received: 

  1st spy call:

  [
-   "#166534",

[Killed] StringLiteral
src/components/ColorPresets.tsx:12:27
     { name: 'Classic', fg: '#000000', bg: '#ffffff' },
     { name: 'Ocean', fg: '#1e3a8a', bg: '#dbeafe' },
     { name: 'Forest', fg: '#166534', bg: '#dcfce7' },
-    { name: 'Sunset', fg: '#dc2626', bg: '#fef2f2' },
+    { name: 'Sunset', fg: "", bg: '#fef2f2' },
     { name: 'Purple', fg: '#7c3aed', bg: '#f3e8ff' },
     { name: 'Amber', fg: '#d97706', bg: '#fef3c7' },
killedBy: ColorPresets Component should call onPresetSelect with correct colors when Sunset preset is clicked
statusReason: expected "spy" to be called with arguments: [ '#dc2626', '#fef2f2' ]

Received: 

  1st spy call:

  [
-   "#dc2626",

[Killed] StringLiteral
src/components/ColorPresets.tsx:13:42
     { name: 'Ocean', fg: '#1e3a8a', bg: '#dbeafe' },
     { name: 'Forest', fg: '#166534', bg: '#dcfce7' },
     { name: 'Sunset', fg: '#dc2626', bg: '#fef2f2' },
-    { name: 'Purple', fg: '#7c3aed', bg: '#f3e8ff' },
+    { name: 'Purple', fg: '#7c3aed', bg: "" },
     { name: 'Amber', fg: '#d97706', bg: '#fef3c7' },
   ];
killedBy: ColorPresets Component should call onPresetSelect with correct colors when Purple preset is clicked
statusReason: expected "spy" to be called with arguments: [ '#7c3aed', '#f3e8ff' ]

Received: 

  1st spy call:

  [
    "#7c3aed",

[Killed] StringLiteral
src/components/ColorPresets.tsx:13:13
     { name: 'Ocean', fg: '#1e3a8a', bg: '#dbeafe' },
     { name: 'Forest', fg: '#166534', bg: '#dcfce7' },
     { name: 'Sunset', fg: '#dc2626', bg: '#fef2f2' },
-    { name: 'Purple', fg: '#7c3aed', bg: '#f3e8ff' },
+    { name: "", fg: '#7c3aed', bg: '#f3e8ff' },
     { name: 'Amber', fg: '#d97706', bg: '#fef3c7' },
   ];
killedBy: ColorPresets Component should render all 6 preset buttons
statusReason: Unable to find an element with the text: Purple. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <label
        class="text-sm font-medium text-gray-700 mb-3 block text-center"

[Killed] ObjectLiteral
src/components/ColorPresets.tsx:14:5
     { name: 'Forest', fg: '#166534', bg: '#dcfce7' },
     { name: 'Sunset', fg: '#dc2626', bg: '#fef2f2' },
     { name: 'Purple', fg: '#7c3aed', bg: '#f3e8ff' },
-    { name: 'Amber', fg: '#d97706', bg: '#fef3c7' },
+    {},
   ];
 
killedBy: ColorPresets Component should render all 6 preset buttons
statusReason: Unable to find an element with the text: Amber. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <label
        class="text-sm font-medium text-gray-700 mb-3 block text-center"

[Killed] StringLiteral
src/components/ColorPresets.tsx:14:13
     { name: 'Forest', fg: '#166534', bg: '#dcfce7' },
     { name: 'Sunset', fg: '#dc2626', bg: '#fef2f2' },
     { name: 'Purple', fg: '#7c3aed', bg: '#f3e8ff' },
-    { name: 'Amber', fg: '#d97706', bg: '#fef3c7' },
+    { name: "", fg: '#d97706', bg: '#fef3c7' },
   ];
 
killedBy: ColorPresets Component should render all 6 preset buttons
statusReason: Unable to find an element with the text: Amber. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <label
        class="text-sm font-medium text-gray-700 mb-3 block text-center"

[Killed] ArrowFunction
src/components/ColorPresets.tsx:23:27
         Color Presets
       </label>
       <div className="grid grid-cols-2 sm:grid-cols-3 gap-2">
-        {presetColors.map((preset) => (
-          <button
-            key={preset.name}
-            onClick={() => onPresetSelect(preset.fg, preset.bg)}
-            className="p-3 border border-gray-200 rounded-lg hover:border-blue-300 transition-all duration-200 group"
-          >
-            <div className="flex items-center gap-2">
-              <div className="flex">
-                <div
-                  className="w-4 h-4 rounded-full border"
-                  style={{ backgroundColor: preset.fg }}
-                />
-                <div
-                  className="w-4 h-4 rounded-full border -ml-1"
-                  style={{ backgroundColor: preset.bg }}
-                />
-              </div>
-              <span className="text-xs font-medium text-gray-700 group-hover:text-blue-600">
-                {preset.name}
-              </span>
-            </div>
-          </button>
-        ))}
+        {presetColors.map(() => undefined)}
       </div>
     </div>
killedBy: ColorPresets Component should render all 6 preset buttons
statusReason: Unable to find an element with the text: Classic. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <label
        class="text-sm font-medium text-gray-700 mb-3 block text-center"

[Killed] ArrowFunction
src/components/ColorPresets.tsx:26:22
         {presetColors.map((preset) => (
           <button
             key={preset.name}
-            onClick={() => onPresetSelect(preset.fg, preset.bg)}
+            onClick={() => undefined}
             className="p-3 border border-gray-200 rounded-lg hover:border-blue-300 transition-all duration-200 group"
           >
killedBy: ColorPresets Component should call onPresetSelect with correct colors when Classic preset is clicked
statusReason: expected "spy" to be called with arguments: [ '#000000', '#ffffff' ]

Number of calls: 0

[Killed] ObjectLiteral
src/components/ColorPresets.tsx:37:26
                 />
                 <div
                   className="w-4 h-4 rounded-full border -ml-1"
-                  style={{ backgroundColor: preset.bg }}
+                  style={{}}
                 />
               </div>
killedBy: ColorPresets Component should apply correct inline styles to color circles
statusReason: expect(element).toHaveStyle()

- Expected

- backgroundColor: rgb(254, 243, 199);
