[Killed] ArrowFunction
src/components/Customization.tsx:28:23
           <input
             type="color"
             value={foregroundColor}
-            onChange={(e) => setForegroundColor(e.target.value)}
+            onChange={() => undefined}
             className="w-12 min-w-[8px] h-12 border border-gray-300 rounded-lg cursor-pointer"
           />
killedBy: Customization Component Single Color Changes should call setForegroundColor when color picker changes
statusReason: expected "spy" to be called with arguments: [ '#ff0000' ]

Number of calls: 0

[Killed] ArrowFunction
src/components/Customization.tsx:50:23
           <input
             type="color"
             value={backgroundColor}
-            onChange={(e) => setBackgroundColor(e.target.value)}
+            onChange={() => undefined}
             className="w-12 min-w-[8px] h-12 border border-gray-300 rounded-lg cursor-pointer"
           />
killedBy: Customization Component Single Color Changes should call setBackgroundColor when color picker changes
statusReason: expected "spy" to be called with arguments: [ '#0000ff' ]

Number of calls: 0
