[Killed] BlockStatement
src/components/InputSection.tsx:9:74
   setText: (text: string) => void;
 };
 
-const InputSection: React.FC<InputSectionProps> = ({ text, setText }) => {
-  return (
-    <div>
-      <label className="flex items-center gap-2 text-sm font-medium text-gray-700 mb-3">
-        <Type className="w-4 h-4" />
-        QR Code Content
-      </label>
-      <textarea
-        value={text}
-        onChange={(e) => setText(e.target.value)}
-        placeholder="Enter URL, text, or any content..."
-        className="w-full p-4 border border-gray-300 rounded-lg focus:ring-2 focus:ring-blue-500 focus:border-transparent transition-all duration-200 resize-none"
-        rows={4}
-      />
-    </div>
-  );
-};
+const InputSection: React.FC<InputSectionProps> = ({ text, setText }) => {};
 
 export default InputSection;
killedBy: InputSection Component should call setText when textarea value changes
statusReason: Unable to find an element with the placeholder text of: Enter URL, text, or any content...

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ArrowFunction
src/components/InputSection.tsx:18:19
       </label>
       <textarea
         value={text}
-        onChange={(e) => setText(e.target.value)}
+        onChange={() => undefined}
         placeholder="Enter URL, text, or any content..."
         className="w-full p-4 border border-gray-300 rounded-lg focus:ring-2 focus:ring-blue-500 focus:border-transparent transition-all duration-200 resize-none"
killedBy: InputSection Component should call setText when textarea value changes
statusReason: expected "spy" to be called with arguments: [ 'https://example.com' ]

Number of calls: 0
