[Killed] BooleanLiteral
src/components/QrCodeDisplay.tsx:19:58
   canvasRef,
   onDownload,
 }) => {
-  const [showPlaceholder, setShowPlaceholder] = useState(false);
+  const [showPlaceholder, setShowPlaceholder] = useState(true);
 
   useEffect(() => {
killedBy: QrCodeDisplay Component should show placeholder after 300ms when text is empty
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p
  class="text-gray-500 text-center px-4"
>
  Enter content to generate QR code
</p> instead

[Killed] BlockStatement
src/components/QrCodeDisplay.tsx:21:19
 }) => {
   const [showPlaceholder, setShowPlaceholder] = useState(false);
 
-  useEffect(() => {
-    if (!text.trim()) {
-      const timeoutId = setTimeout(() => {
-        setShowPlaceholder(true);
-      }, 300);
-
-      return () => clearTimeout(timeoutId);
-    } else {
-      setShowPlaceholder(false);
-    }
-  }, [text]);
+  useEffect(() => {}, [text]);
 
   return (
killedBy: QrCodeDisplay Component should show placeholder after 300ms when text is empty
statusReason: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has type:  Null
Received has value: null

[Killed] ConditionalExpression
src/components/QrCodeDisplay.tsx:22:9
   const [showPlaceholder, setShowPlaceholder] = useState(false);
 
   useEffect(() => {
-    if (!text.trim()) {
+    if (false) {
       const timeoutId = setTimeout(() => {
         setShowPlaceholder(true);
killedBy: QrCodeDisplay Component should show placeholder after 300ms when text is empty
statusReason: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has type:  Null
Received has value: null

[Killed] BlockStatement
src/components/QrCodeDisplay.tsx:22:23
   const [showPlaceholder, setShowPlaceholder] = useState(false);
 
   useEffect(() => {
-    if (!text.trim()) {
-      const timeoutId = setTimeout(() => {
-        setShowPlaceholder(true);
-      }, 300);
-
-      return () => clearTimeout(timeoutId);
-    } else {
+    if (!text.trim()) {} else {
       setShowPlaceholder(false);
     }
killedBy: QrCodeDisplay Component should show placeholder after 300ms when text is empty
statusReason: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has type:  Null
Received has value: null

[Killed] BlockStatement
src/components/QrCodeDisplay.tsx:23:42
 
   useEffect(() => {
     if (!text.trim()) {
-      const timeoutId = setTimeout(() => {
-        setShowPlaceholder(true);
-      }, 300);
+      const timeoutId = setTimeout(() => {}, 300);
 
       return () => clearTimeout(timeoutId);
killedBy: QrCodeDisplay Component should show placeholder after 300ms when text is empty
statusReason: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has type:  Null
Received has value: null

[Killed] BooleanLiteral
src/components/QrCodeDisplay.tsx:24:28
   useEffect(() => {
     if (!text.trim()) {
       const timeoutId = setTimeout(() => {
-        setShowPlaceholder(true);
+        setShowPlaceholder(false);
       }, 300);
 
killedBy: QrCodeDisplay Component should show placeholder after 300ms when text is empty
statusReason: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has type:  Null
Received has value: null

[Survived] BlockStatement
src/components/QrCodeDisplay.tsx:28:12
       }, 300);
 
       return () => clearTimeout(timeoutId);
-    } else {
-      setShowPlaceholder(false);
-    }
+    } else {}
   }, [text]);
 

[Survived] BooleanLiteral
src/components/QrCodeDisplay.tsx:29:26
 
       return () => clearTimeout(timeoutId);
     } else {
-      setShowPlaceholder(false);
+      setShowPlaceholder(true);
     }
   }, [text]);

[Survived] ArrayDeclaration
src/components/QrCodeDisplay.tsx:31:6
     } else {
       setShowPlaceholder(false);
     }
-  }, [text]);
+  }, []);
 
   return (

[Killed] ConditionalExpression
src/components/QrCodeDisplay.tsx:37:12
     <div className="flex flex-col items-center">
       <div className="w-full max-w-xs mx-auto">
         <div className="bg-gray-50 rounded-xl p-6 mb-6 relative aspect-square">
-          {isGenerating && (
-            <div className="absolute inset-0 bg-white bg-opacity-75 rounded-xl flex items-center justify-center">
-              <RefreshCw className="w-6 h-6 text-blue-500 animate-spin" />
-            </div>
-          )}
+          {false}
           
           <div className="w-full h-full flex items-center justify-center">
killedBy: QrCodeDisplay Component should show loading spinner when isGenerating is true
statusReason: Unable to find an element by: [data-testid="mock-refresh-icon"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex flex-col items-center"
    >

[Killed] LogicalOperator
src/components/QrCodeDisplay.tsx:37:12
     <div className="flex flex-col items-center">
       <div className="w-full max-w-xs mx-auto">
         <div className="bg-gray-50 rounded-xl p-6 mb-6 relative aspect-square">
-          {isGenerating && (
-            <div className="absolute inset-0 bg-white bg-opacity-75 rounded-xl flex items-center justify-center">
-              <RefreshCw className="w-6 h-6 text-blue-500 animate-spin" />
-            </div>
-          )}
+          {isGenerating || <div className="absolute inset-0 bg-white bg-opacity-75 rounded-xl flex items-center justify-center">
+              <RefreshCw className="w-6 h-6 text-blue-500 animate-spin" />
+            </div>}
           
           <div className="w-full h-full flex items-center justify-center">
killedBy: QrCodeDisplay Component should show loading spinner when isGenerating is true
statusReason: Unable to find an element by: [data-testid="mock-refresh-icon"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex flex-col items-center"
    >

[Killed] BooleanLiteral
src/components/QrCodeDisplay.tsx:50:14
               style={{ display: qrDataUrl ? 'block' : 'none' }}
             />
             
-            {!text.trim() && showPlaceholder && (
+            {text.trim() && showPlaceholder && (
               <div className="w-full h-full bg-gray-200 rounded-lg flex items-center justify-center transition-opacity duration-300 ease-in-out">
                 <p className="text-gray-500 text-center px-4">
killedBy: QrCodeDisplay Component should show placeholder after 300ms when text is empty
statusReason: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has type:  Null
Received has value: null

[Killed] LogicalOperator
src/components/QrCodeDisplay.tsx:50:14
               style={{ display: qrDataUrl ? 'block' : 'none' }}
             />
             
-            {!text.trim() && showPlaceholder && (
-              <div className="w-full h-full bg-gray-200 rounded-lg flex items-center justify-center transition-opacity duration-300 ease-in-out">
-                <p className="text-gray-500 text-center px-4">
-                  Enter content to generate QR code
-                </p>
-              </div>
-            )}
+            {!text.trim() && showPlaceholder || <div className="w-full h-full bg-gray-200 rounded-lg flex items-center justify-center transition-opacity duration-300 ease-in-out">
+                <p className="text-gray-500 text-center px-4">
+                  Enter content to generate QR code
+                </p>
+              </div>}
           </div>
         </div>
killedBy: QrCodeDisplay Component should show placeholder after 300ms when text is empty
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p
  class="text-gray-500 text-center px-4"
>
  Enter content to generate QR code
</p> instead

[Killed] ConditionalExpression
src/components/QrCodeDisplay.tsx:61:8
         </div>
       </div>
 
-      {qrDataUrl && (
-        <button
-          onClick={onDownload}
-          className="flex items-center gap-2 bg-blue-600 hover:bg-blue-700 text-white px-6 py-3 rounded-lg transition-all duration-200 font-medium shadow-lg hover:shadow-xl"
-        >
-          <Download className="w-5 h-5" />
-          Download QR Code
-        </button>
-      )}
+      {false}
     </div>
   );
killedBy: QrCodeDisplay Component should show download button when qrDataUrl is provided
statusReason: Unable to find an accessible element with the role "button" and name `/download qr code/i`

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div>
    <div

[Killed] ConditionalExpression
src/components/QrCodeDisplay.tsx:61:8
         </div>
       </div>
 
-      {qrDataUrl && (
-        <button
-          onClick={onDownload}
-          className="flex items-center gap-2 bg-blue-600 hover:bg-blue-700 text-white px-6 py-3 rounded-lg transition-all duration-200 font-medium shadow-lg hover:shadow-xl"
-        >
-          <Download className="w-5 h-5" />
-          Download QR Code
-        </button>
-      )}
+      {true}
     </div>
   );
killedBy: QrCodeDisplay Component should show download button when qrDataUrl is provided
statusReason: Unable to find an accessible element with the role "button" and name `/download qr code/i`

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div>
    <div
